cask_args appdir: "/Applications"
tap "homebrew/cask"

# basic environment
brew "git"
brew "git-flow"
brew "bash"
brew "zsh"
brew "vim"
brew "tig"
brew "tmux"
brew "the_silver_searcher"
brew "ansible"
# ruby
brew "rbenv"
# swift
brew "swiftenv"
brew "swiftformat"
brew "swiftlint"
# nodejs
brew "nodenv"

# cask
cask "docker"
cask "google-chrome"
cask "scroll-reverser"
cask "appcleaner"
cask "visual-studio-code"
