cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "kylef/formulae"
tap "vapor/homebrew-tap"

# basic environment
brew "git", args: ["without-completions"]
brew "git-flow"
brew "bash"
brew "zsh"
brew "vim"
brew "tig"
brew "tmux"
brew "the_silver_searcher"
brew "ansible"
brew "mas"

# ruby
brew "rbenv"

# swift
brew "swiftenv"
brew "swiftformat"
brew "vapor"

# nodejs
brew "nodenv"

# cask
cask "iterm2"
cask "docker"
cask "google-chrome"
cask "scroll-reverser"
cask "appcleaner"
cask "visual-studio-code"
cask "stride"
cask "zeplin"

# mas
mas "Xcode", id: 497799835
mas "LINE", id: 539883307

# swiftlint(depend on Xcode)
brew "swiftlint"
